def str2hms(hms_str): 
    # คนจำนวนชวโมง นำท และวนำท ที่ดึงมำจำกสตริง hms 
    # เชน str2hms("10:03:29") ได้ 10,3,29 
    t = hms_str.split(':') 
    return int(t[0]),int(t[1]),int(t[2]) 
 
def hms2str(h,m,s): 
    # คืนสตริงในรูปแบบ HH:MM:SS ที่น ำจ ำนวนชวโมง นำที และวินำทีมำจำก h,m และ s  
    # เชน hms2str(10,3,29) ได้ "10:03:29" 
    return ('0'+str(h))[-2:] + ':' + \
           ('0'+str(m))[-2:] + ':' + \
           ('0'+str(s))[-2:] 
     
def to_sec(h,m,s): 
    # คืนจ ำนวนวินำทีทั ้งหมดนับจำกเที่ยงคืนจำกถึงเวลำ h:m:s 
    # เชน to_sec(10,3,29) ได้ 36209 
 
    return s+m*60+h*60*60
 
def to_hms(s): 
    # คืนจ ำนวนชวโมง นำที และวินำที ที่หำมำจำกจ ำนวนวินำที่ s ทั ้งหมดนับจำกเที่ยงคืน  
    # เชน to_hms(36209) ได้ 10,3,29 
 
    return s//3600,(s%3600)//60,(s%60)
 
def diff(h1,m1,s1,h2,m2,s2): 
    # คืนจำนวนชวโมง นำท และวนำท จะเปนชวงเวลำตงแตเวลำ h1,m1,s1 จนถึง h2,m2,s2 
    # เชน diff(10,57,57, 12,0,0) ได้ 1,2,3 
    # หมำยเหตุ เวลำ h1,m1,s1 ที่ได้รับ ไม่มำกกว่ำ h2,m2,s2 แน่ ๆ  
    # (เชน ไม่มีกรณีให้หำชวงเวลำตั ้งแต่ 23,50,50 ถึง 2,1,1 แน่ ๆ) 
 
    return to_hms(to_sec(h2,m2,s2)-to_sec(h1,m1,s1))
 
def main(): 
    # ฟงกชนนรับเวลำเริ่มต้น และเวลำสนสด ในรูปแบบ HH:MM:SS 
    # เพอแสดงชวงเวลำตั ้งแต่เริ่มจนถึงสนสด ในรูปแบบ HH:MM:SS 
    # ดูตัวอย่ำงในตำรำงข้ำงล่ำง 
    hms_start = input() 
    hms_end = input()
    a,b,c = str2hms(hms_end)
    d,e,f = str2hms(hms_start)
    h,m,s = diff(d,e,f,a,b,c)
    print(hms2str(h,m,s))
     
exec(input()) # DON'T remove this line 